rails/blog/app/controllers/comments_controller.rb

SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
---
  def index
    @post = Post.find(params[:post_id])

SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
SELECT * FROM `comments` WHERE (`comments`.`id` = 1 AND (`comments`.post_id = 1))
---
  def show
    @post = Post.find(params[:post_id])
    @comment = @post.comments.find(params[:id])

SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
---
  def new
    @post = Post.find(params[:post_id])

SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
INSERT INTO `comments` (`body`, `commenter`, `post_id`, `updated_at`, `created_at`) VALUES('sdsdsdsdsd', 'dddddddddddssd', 17, '2017-06-20 06:09:53', '2017-06-20 06:09:53')
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.build(params[:comment])
    if @comment.save

SELECT * FROM `posts` WHERE (`posts`.`id` = 17)
SELECT * FROM `comments` WHERE (`comments`.`id` = 5 AND (`comments`.post_id = 17))
---
  def edit
    @post = Post.find(params[:post_id])
    @comment = @post.comments.find(params[:id])

SELECT * FROM `posts` WHERE (`posts`.`id` = 17)
SELECT * FROM `comments` WHERE (`comments`.`id` = 5)
---
  def update
    @post = Post.find(params[:post_id])
    @comment = Comment.find(params[:id])