rails/blog/app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`updated_at`, `column_1`, `title`, `created_at`, `name`, `content`) VALUES('2017-06-20 06:02:08', 150, 'dsfsdfsdfsdf', '2017-06-20 06:02:08', 'dsfsdsd', 'ddfdsfsdfds')

  def update

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
UPDATE `posts` SET `updated_at` = '2017-06-20 05:46:42', `content` = 'riding ' WHERE `id` = 1

  def destroy
    @post.destroy
---
DELETE FROM `posts` WHERE `id` = 3

    def find_post
      @post = Post.find(params[:id])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 3)