9/bizz/app/controllers/accounts_controller.rb

  def index
    @accounts = Account.all
---
SELECT * FROM "accounts"

  def create
    @account_details = Account.new(params[:accounts])
    if @account_details.save
---
INSERT INTO "accounts" ("username", "password", "updated_at", "created_at") VALUES('dsafsa', 'fadgafa', '2017-08-28 07:15:50', '2017-08-28 07:15:50')