9/bizz/app/controllers/items_controller.rb

SELECT * FROM "items"
---
  def index
    @items = Item.all

SELECT * FROM "items" WHERE ("items"."id" = 1)
---
  def show
    begin
      @item = Item.find(params[:id])

SELECT * FROM "items" WHERE ("items"."id" = 1)
---
  def edit
    @item = Item.find(params[:id])

INSERT INTO "items" ("name", "updated_at", "created_at", "price", "MRP") VALUES('fdgrw', '2017-08-03 10:00:17', '2017-08-03 10:00:17', 4.0, 3.0)
---
  def create
    @item = Item.new(params[:item])

    respond_to do |format|
      if @item.save

SELECT * FROM "items" WHERE ("items"."id" = 1)
UPDATE "items" SET "description" = 'egqvefqeg feq gwgqf qff fqgwf fqff', "updated_at" = '2017-08-04 06:07:13' WHERE "id" = 2
---
  def update
    @item = Item.find(params[:id])

    respond_to do |format|
      if @item.update_attributes(params[:item])