9/bizz/app/controllers/reviews_controller.rb

SELECT * FROM "items" WHERE ("items"."id" = 2)
---
  def index
    @item = Item.find(params[:item_id])

SELECT * FROM "items" WHERE ("items"."id" = 2)
SELECT * FROM "reviews" WHERE ("reviews"."id" = 0 AND ("reviews".item_id = 2))
---
  def show
    @item = Item.find(params[:item_id])
    @review = @item.reviews.find(params[:id])

SELECT * FROM "items" WHERE ("items"."id" = 2)
---
  def new
    @item = Item.find(params[:item_id])

SELECT * FROM "items" WHERE ("items"."id" = 2)
INSERT INTO "reviews" ("updated_at", "item_id", "created_at", "body", "reviewer") VALUES('2017-08-04 06:51:48', 2, '2017-08-04 06:51:48', 'bjkfbqejq nflekqnfqjfondi', 'ajay')
---
  def create
    @item = Item.find(params[:item_id])
    @review = @item.reviews.build(params[:review])
    if @review.save

SELECT * FROM "items" WHERE ("items"."id" = 2)
SELECT * FROM "reviews" WHERE ("reviews"."id" = 1 AND ("reviews".item_id = 2))
---
  def edit
    @item = Item.find(params[:item_id])
    @review = @item.reviews.find(params[:id])

SELECT * FROM "items" WHERE ("items"."id" = 2)
SELECT * FROM "reviews" WHERE ("reviews"."id" = 1 AND ("reviews".item_id = 2))
UPDATE "reviews" SET "body" = 'bjkfbqejq nflekqnfqjfondi 6563 tryh4w', "updated_at" = '2017-08-04 06:53:47' WHERE "id" = 1
---
  def update
    @item = Item.find(params[:item_id])
    @review = @item.reviews.find(params[:id])

    if @review.update_attributes(params[:review])

SELECT * FROM "items" WHERE ("items"."id" = 2)
SELECT * FROM "reviews" WHERE ("reviews"."id" = 2 AND ("reviews".item_id = 2))
DELETE FROM "reviews" WHERE "id" = 2
---
  def destroy
    @item = Item.find(params[:item_id])
    @review = @item.reviews.find(params[:id])
    @review.destroy