9/bizz/app/controllers/sessions_controller.rb

SELECT "accounts".id FROM "accounts" WHERE ("accounts"."username" = 'admin') LIMIT 1
---
  def login
    @user = params[:account][:username]
    @pwd = params[:account][:password]
    @account = Account.find(:first, :conditions => ["username = ?", @user])